app/controllers/school_classes_controller.rb

    def create
        @schoolclass = SchoolClass.new
        # byebug
        @schoolclass.title = params["school_class"]["title"]
        @schoolclass.room_number = params["school_class"]["room_number"]
        @schoolclass.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "adsf"], ["room_number", 0], ["created_at", "2020-02-26 17:59:06.730039"], ["updated_at", "2020-02-26 17:59:06.730039"]]

    def show
        @schoolclass = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def edit
        @schoolclass = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def update
        @schoolclass = SchoolClass.find_by_id(params[:id])
        @schoolclass.update(title: params["school_class"]["title"], room_number: params["school_class"]["room_number"])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 209], ["updated_at", "2020-02-26 19:12:35.407080"], ["id", 3]]