app/controllers/students_controller.rb

    def create
        @student = Student.new
        @student.first_name = params["student"]["first_name"]
        @student.last_name = params["student"]["last_name"]
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Jonny"], ["last_name", "Riecke"], ["created_at", "2020-02-26 18:50:44.451009"], ["updated_at", "2020-02-26 18:50:44.451009"]]

    def show
        @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]